# install Cask
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
cask_args appdir: "/Applications"

# install cli binaries and tools
brew "zsh"
brew "httpie"
brew "python3"
brew "node"
brew "vim"
brew "tmux"
brew "grep"
brew "ruby"
brew "rust"
brew "fzf"

# install apps
cask "docker"
cask "firefox"
cask "google-chrome"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "iterm2"
cask "alfred"
cask "gpg-suite"
cask "lulu"
cask "alacritty"
cask "opera"
cask "1password"
cask "whatsapp"
cask "tidal"
cask "expressvpn"

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"

# awesome fonts
cask "font-source-code-pro"

# install mac app store apps
mas "Bear", id: 1091189122
mas "Messenger", id: 1480068668
mas "Spark", id: 1176895641
